app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
    @appointments = Appointment.all

INSERT INTO "appointments" ("title", "description", "event_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Ensar"], ["description", "Dogum gunu"], ["event_date", "1995-10-03"], ["created_at", "2018-06-27 14:06:55.142524"], ["updated_at", "2018-06-27 14:06:55.142524"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])